case2_2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.5 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }


    outlet
    {
        type            zeroGradient;
    }

    upperwall
    {
        type            symmetry;
    }
    lowerwall
    {
        type            symmetry;
    }
    pipe1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    pipe2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    frontandback
    {
        type            empty;
    }
}

// ************************************************************************* //
