case2_2/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    frontandback
    {
        type            empty;
    }
    upperwall
    {
        type            symmetry;
    }
    lowerwall
    {
        type            symmetry;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    pipe1
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
26.9704
26.9704
33.92
36.5186
28.0591
36.4793
28.0591
19.0677
...
)
;
    }
    pipe2
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
25.6212
25.6212
38.0748
30.1436
34.177
26.6777
24.2184
24.0542
...
)
;
    }
}


// ************************************************************************* //
